SOAP-WSC/ECS/PurchasePoints.xml

<!-- REQUEST -->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:ecs="urn:ecs.wsapi.broadon.com">
<SOAP-ENV:Body>
<ecs:PurchasePoints xsi:type="ecs:PurchasePointsRequestType">
  <ecs:Version>2.0</ecs:Version>
  <ecs:MessageId>ECSHOP-*-*</ecs:MessageId>
  <ecs:DeviceId>*</ecs:DeviceId>
  <ecs:DeviceToken>ST-*</ecs:DeviceToken>
  <ecs:AccountId>*</ecs:AccountId>
  <ecs:Region>*</ecs:Region>
  <ecs:Country>*</ecs:Country>
  <ecs:Language>*</ecs:Language>
  <ecs:SerialNo>*</ecs:SerialNo>
  <ecs:ItemId>100132</ecs:ItemId> <!-- 50.00, EUR -->
  <ecs:Price>
    <ecs:Amount>50.00</ecs:Amount>
    <ecs:Currency>EUR</ecs:Currency>
  </ecs:Price>
  <ecs:Taxes>*</ecs:Taxes> <!-- -->
  <ecs:Discount>*</ecs:Discount> <!-- ??? -->
  <ecs:Payment>
    <ecs:PaymentMethod>CCARD</ecs:PaymentMethod> <!-- CCARD, ECARD -->
    <ecs:CreditCardPayment>
      <ecs:CreditCardNumber>*</ecs:CreditCardNumber> <!-- if not encrypted, the card is 16 characters, else its the last 4 characters -->
      <ecs:IsEncrypted>*</ecs:IsEncrypted>
      <!-- if encrypted, it should be true, otherwise leave out -->
    </ecs:CreditCardPayment>
    <!-- if PaymentMethod is ECARD -->
    <!--
    <ecs:ECardPayment>
      <ecs:ECardNumber>*</ecs:ECardNumber>
      <ecs:ECardHash>*</ecs:ECardHash> // possibly a sha1 hash of ECardNumber
      <ecs:ECardType>*</ecs:ECardType> // ???, integer apparently
    -->
    <!-- if PaymentMethod is ACCOUNT (it should never be, though) -->
    <!--
    <ecs:AccountPayment>
      <ecs:AccountNumber>*</ecs:AccountNumber> // account id
      <ecs:DeviceToken>*</ecs:DeviceToken>
    </ecs:AccountPayment>
    -->
  </ecs:Payment>
  <ecs:PurchaseInfo>*</ecs:PurchaseInfo> <!-- ???, apparently looks for vcMessage and transId in another XML? -->
  <ecs:Points>5000</ecs:Points>
  <ecs:Quantity>1</ecs:Quantity> <!-- always 1 -->
</ecs:PurchasePoints>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<!-- RESPONSE -->
<!-- TODO: bypass PAS error and add headers -->

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <PurchasePointsResponse xmlns="urn:ecs.wsapi.broadon.com">
            <Version>2.0</Version>
            <DeviceId>*</DeviceId>
            <MessageId>ECSHOP-*-*</MessageId>
            <TimeStamp>*</TimeStamp>
            <ErrorCode>899</ErrorCode>
            <ErrorMessage>PAS - Internal Error: PAS - Internal ErrorPAS - Internal Error: got JAXBException while transforming xml String to obj</ErrorMessage>
            <ServiceStandbyMode>false</ServiceStandbyMode>
            <PurchaseInfo>0</PurchaseInfo>
            <Transactions>
                <TransactionId>*</TransactionId>
                <Date>*</Date>
                <Type>PURCHPTS</Type>
            </Transactions>
        </PurchasePointsResponse>
    </soapenv:Body>
</soapenv:Envelope>
